In [22]:
from pandas import Series,DataFrame
import numpy as np 
import pandas as pd
from numpy import nan as NA
#pandas数据结构  series  dataframe
#series
series1= Series(np.array([2,4,7,2,5]).astype(np.float32))
series1

0    2.0
1    4.0
2    7.0
3    2.0
4    5.0
dtype: float32

In [30]:
series2=Series(np.random.randint(100,size=2),index=['a','b'])
#series2.values
#$series2.index
#index search
series2['a']
#dict create series
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000}
s1=[1,2,3,4,5,6]
i1=['Ohio','b','c','Texas','e','Oregon','g']
series3=Series(sdata)
series3
#series4=Series(s1,i1)
series4=Series(sdata,i1)
series4
#update index
#series4.index=[1,2,3,4,5,6,7]
pd.isnull(series4)

Ohio      False
b          True
c          True
Texas     False
e          True
Oregon    False
g          True
dtype: bool

In [4]:
#DataFrame
dataf={'state':['a','b','c','d'],
       'year':[2000,2001,2002,2003],
        'pop':[1.1,1.3,2.1,2.6]}
dataframe1=DataFrame(dataf)
dataframe1
#dataframe1['state']
#dataframe1.year
#dataframe1.columns
#data2=dataframe1.ix(1)
#data2
print(dataframe2)
#NA情况
dataframe2=DataFrame(dataf,columns=['pop','state','year','dept'],index=['one','two','three','four'])
#dataframe2.ix['three']
#选取一个元素
print(dataframe2['state']['three'])
print(dataframe2.ix['three'])
#dataframe2['dept']=1.1
dataframe2['dept']=np.arange(4)
dataframe2
#使用series 给dataframe赋值
val=Series([1.1,1.3,1.4],index=['two','three','one'])
dataframe2['dept']=val
#dataframe2
dataframe2['exe']=dataframe2['state']=='a'
print(dataframe2)

       pop state  year  dept    exe
one    1.1     a  2000   1.4   True
two    1.3     b  2001   1.1  False
three  2.1     c  2002   1.3  False
four   2.6     d  2003   NaN  False
c
pop       2.1
state       c
year     2002
dept      NaN
Name: three, dtype: object
       pop state  year  dept    exe
one    1.1     a  2000   1.4   True
two    1.3     b  2001   1.1  False
three  2.1     c  2002   1.3  False
four   2.6     d  2003   NaN  False

 ## 删除列

In [9]:
del dataframe2['exe']
dataframe2

       pop state  year  dept
one    1.1     a  2000   1.4
two    1.3     b  2001   1.1
three  2.1     c  2002   1.3
four   2.6     d  2003   NaN

## 嵌套字典创建DataFrame

In [23]:
#内嵌字典的键值会被合并 显示指定索引会排除不被合并
data_dict={'Nevada':{2001:2.4,2002:2.9},
           'Ohio':{2000:1.5,2001:1.5,2002:2.2}}
data_dict_frame=DataFrame(data_dict)
data_dict_frame
data_dict_frame.T
data_dict_frame2=DataFrame(data_dict,index=[2001,2002,2003])
#排除了data_dict中的2000索引数据
data_dict_frame2
data_dict2={'Nevada':data_dict_frame['Nevada'][:-1],
           'Ohio':data_dict_frame['Ohio'][:-1]}
data_dict_frame3=DataFrame(data_dict2)
data_dict_frame3
2003 in data_dict_frame3.index
'Ohio' in data_dict_frame3.columns

True

In [16]:
data_dict_frame3.index.name='years';data_dict_frame3.columns.name='state'
data_dict_frame3

state  Nevada  Ohio
years
2000      NaN   1.5
2001      2.4   1.5

## Index对象

In [21]:
obj=Series(range(3),index=['a','b','c'])
indexs=obj.index
indexs[1:]#不能修改
#创建索引对象
index1=pd.Index(np.arange(3))
index1
obj2=Series([0.1,1.3,3.2],index=index1)
obj2

0    0.1
1    1.3
2    3.2
dtype: float64

In [24]:
obj3 = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj3

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [26]:
obj4 = obj3.reindex(['a', 'b', 'c', 'd', 'e'])
obj4

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [28]:
data_fra1=DataFrame(np.arange(9).reshape((3,3)),columns=['c1','c2','c3'],index=list(range(3)))
data_fra1

   c1  c2  c3
0   0   1   2
1   3   4   5
2   6   7   8

In [40]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
print(data)
a=data.drop(['Colorado', 'Ohio'],axis=0)
print(a)
b=data.drop('two',axis=1)
bt

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [6]:
obj5=Series(['blue','purple','yellow'],index=[0,2,4])
obj5.reindex(list(range(6)),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [23]:
data5 = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data5['two']['Ohio']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [24]:
data5[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

## DataFrame与Series运算

In [7]:
frame1=DataFrame(np.arange(12).reshape(4,3),columns=list('bde'),index=['A','B','C','D'])
frame1

   b   d   e
A  0   1   2
B  3   4   5
C  6   7   8
D  9  10  11

In [11]:
series1=frame1.ix[0]
print(series1)
series2=frame1['d']
print(series2)

#frame1-series1
frame1.sub(series2,axis=0)

b    0
d    1
e    2
Name: A, dtype: int64
A     1
B     4
C     7
D    10
Name: d, dtype: int64

   b  d  e
A -1  0  1
B -1  0  1
C -1  0  1
D -1  0  1

In [5]:
frame12=DataFrame({'qu1':[1,2,3,4,5],'qu2':[3,5,2,5,6],'qu3':[9,3,5,2,5]})
frame12

   qu1  qu2  qu3
0    1    3    9
1    2    5    3
2    3    2    5
3    4    5    2
4    5    6    5

In [6]:
result=frame12.apply(pd.value_counts).fillna(0)
result

   qu1  qu2  qu3
1  1.0  0.0  0.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  0.0  0.0
5  1.0  2.0  2.0
6  0.0  1.0  0.0
9  0.0  0.0  1.0

In [11]:
df5j1=DataFrame(np.random.randn(7,3))
df5j1.ix[:4,1]=NA;df5j1.ix[:2,2]=NA
df5j2=df5j1.fillna({1:0.5,3:-1})
df5j2

          0         1         2
0 -1.820561  0.500000       NaN
1 -0.111903  0.500000       NaN
2 -0.784982  0.500000       NaN
3 -0.387187  0.500000 -0.683803
4  0.491796  0.500000 -0.273139
5 -0.263615 -1.193149  0.003371
6  0.832760  1.069333 -0.070166

In [ ]:
df5j1.dropna()
df5j1.dropna(how='all')

# 层次化索引

In [12]:
data1_1=Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,1,2]])
data1_1

a  1   -0.229872
   2    0.505145
   3    0.026427
b  1   -1.055477
   2   -0.054084
   3   -1.288271
c  1    0.593398
   2   -0.847167
d  1   -0.938821
   2    0.786499
dtype: float64

In [13]:
data1_1['b']

1   -1.055477
2   -0.054084
3   -1.288271
dtype: float64

In [19]:
#data1_1['b':'c']
data1_1[['b','c']]

b  1   -1.055477
   2   -0.054084
   3   -1.288271
c  1    0.593398
   2   -0.847167
dtype: float64

In [17]:
data1_1.ix[['b','c']]

b  1   -1.055477
   2   -0.054084
   3   -1.288271
c  1    0.593398
   2   -0.847167
dtype: float64

In [26]:
#内层选取
data1_1[:,1]
#data1_1.ix[:,1]

a   -0.229872
b   -1.055477
c    0.593398
d   -0.938821
dtype: float64

In [30]:
#拆分多层索引
a1=data1_1.unstack()
print(type(a1))
#dataframe取逆是多层索引series
a2=a1.stack()
print(type(a2))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

# 每条轴分层索引

In [11]:
frame_1=DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
print(frame_1)
frame_1['Ohio','Green']['a']

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

1    0
2    3
Name: (Ohio, Green), dtype: int64

# 重排分级顺序

In [21]:
frame_1.index.names=['key1','key2']
frame_1.columns.names=['state','color']
frame_2=frame_1.swaplevel('key1','key2')
print(frame_2)
frame_2.sortlevel(0,1).sortlevel(0)
frame_2

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11